snlkuharlocal/src/Documents/АктПриемки/АктПриемки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПриемки</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.РасхожденияПоАкту</registerRecords>
  <attributes>
    <name>РНК</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаТовара</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СостоянияРКМ</name>
    <type>
      <types>EnumRef.СостоянияРКМ</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокумента</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАкта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееКоличество</name>
    <comment>в штуках (некоторые в коробах присылают)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостоянияКЦН</name>
    <type>
      <types>EnumRef.СостоянияРКМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАктаПриемки</name>
    <comment>Идентификатор акта приемки у покупателя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <comment>Из Акта приемки от контрагента</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПриемки</name>
      <comment>безНДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПриемки</name>
      <comment>без НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтВУпаковке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПриемкиСНДС</name>
      <comment>с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПриемкиСНДС</name>
      <comment>с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеКонтрагента</name>
      <comment>Наименование из Екода</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/РасхожденияПоАкту/РасхожденияПоАкту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасхожденияПоАкту</name>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Принято</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РНК</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/СостоянияРКМ/СостоянияРКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияРКМ</name>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
  <enumValues>
    <name>СовпадаетСАктом</name>
  </enumValues>
  <enumValues>
    <name>НеСовпадаетСАктом</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипСклада/ТипСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипСклада</name>
  <enumValues>
    <name>ОптовыйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>РозничныйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Офис</name>
  </enumValues>
  <enumValues>
    <name>КБСтиль</name>
  </enumValues>
  <enumValues>
    <name>SNL</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСклад</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСкладРезерв</name>
  </enumValues>
  <enumValues>
    <name>ПалетноеХранение</name>
  </enumValues>
  <enumValues>
    <name>СкладВозвратов</name>
  </enumValues>
  <enumValues>
    <name>КомиссионныйСклад</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
  <enumValues>
    <name>Перепаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/АктПриемки/ObjectModule.bsl
Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим) Экспорт
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТекСтрокаТовары.Отправлено <> ТекСтрокаТовары.Принято Тогда
			Движение = Движения.РасхожденияПоАкту.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.РНК = РНК;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Отправлено = ТекСтрокаТовары.Отправлено;
			Движение.Принято = ТекСтрокаТовары.Принято;
		КонецЕсли;
	КонецЦикла;
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		// Заполнение шапки
		ДатаЗаказа = Основание.ДатаЗаказа;
		Контрагент = Основание.Контрагент;
		НомерЗаказа = Основание.НомерЗаказа;
		ПунктДоставки = Основание.ПунктДоставки;
		Склад = Основание.Склад;
		Организация = Основание.Организация;
		РНК = Основание.Ссылка;
		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Заказано = ТекСтрокаТовары.Заявка;
			НоваяСтрока.Отправлено = ТекСтрокаТовары.Количество;
			НоваяСтрока.Принято = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//Катаев+ 09/04/13
	//Если ЭтотОбъект.Проведен Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	//Катаев- 09/04/13
	// Проверяем наличие РКМ по РНК
	Если РНК <> Документы.РасходнаяНакладная.ПустаяСсылка() Тогда
		//Запрос = Новый Запрос;
		//Запрос.Текст =
		//"ВЫБРАТЬ
		//|	РекламационнаяНакладная.Ссылка
		//|ИЗ
		//|	Документ.РекламационнаяНакладная КАК РекламационнаяНакладная
		//|ГДЕ
		//|	РекламационнаяНакладная.ДокОснование = &РНК";
		//Запрос.УстановитьПараметр("РНК", РНК);
		//Выборка = Запрос.Выполнить().Выбрать();
		//Если Выборка.Следующий() Тогда
		//	Отказ = Истина;
		//КонецЕсли;
	КонецЕсли;
	// Проверяем наличие рассхождений
	СостояниеДокумента1 = Перечисления.СостоянияНакладной.Доставлена;
	СостоянияРКМ1 = Перечисления.СостоянияРКМ.НеТребуется;
	Если Товары.Итог("Отправлено") = Товары.Итог("Принято") Тогда
		Для каждого стр из Товары Цикл
			Если стр.Отправлено <> стр.Принято Тогда
				СостояниеДокумента1 = Перечисления.СостоянияНакладной.Принята;
				СостоянияРКМ1 = Перечисления.СостоянияРКМ.Отсутствует;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		СостояниеДокумента1 = Перечисления.СостоянияНакладной.Принята;
		СостоянияРКМ1 = Перечисления.СостоянияРКМ.Отсутствует;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//Катаев+ 03/12/14 переделал регистрацию в узлах, по причине что и в филиалах акты приемки грузятся
	////Катаев+ 14/02/14 Регистрируем акты приемки в Одинцово1 по Контрагентам которые участвуют в ЭСФ
	////Катаев+ 23/04/14 Регистрацию надо делать только из ЦО
	//Если ПланыОбмена.Основной.ЭтотУзел().Код <> "SNL" Тогда
	//	Возврат;
	//КонецЕсли;
	////Катаев- 23/04/14
	//Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) Тогда
	//	ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.Основной.НайтиПоКоду("ODN"), ЭтотОбъект.Ссылка);
	//КонецЕсли;
	////Катаев- 14/02/14
	
	//+++Чирков 10.09.2029
	//Если ПланыОбмена.Основной.ЭтотУзел().Код = "SNL" Тогда
	//	Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) И Склад.ТипСклада <> Перечисления.ТипСклада.Филиал Тогда
	//		// нечаева 08,02,16+++
	//		ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.Основной.НайтиПоКоду("OD7"), ЭтотОбъект.Ссылка);
	//		// нечаева 08,02,16---
	//	КонецЕсли;
	//ИначеЕсли ПланыОбмена.Основной.ЭтотУзел().Подразделение.ЕстьВыделенныйСклад И Склад.КодФизическогоУзла = ПланыОбмена.Основной.ЭтотУзел().Код Тогда
	//	ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.Основной.НайтиПоКоду("SNL"), ЭтотОбъект.Ссылка);
	//КонецЕсли;            
	
	Если ОбщегоНазначения_ПИ.ЭтоУзел_ЦО() Тогда
		Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) И Склад.ТипСклада <> Перечисления.ТипСклада.Филиал Тогда
			// нечаева 08,02,16+++
			ПланыОбмена.ЗарегистрироватьИзменения(Маркировка_ПИ.УзелПоКоду("OD7", "Основной"), Ссылка);
			// нечаева 08,02,16---
		КонецЕсли;
	Иначе
		мПодразделение = ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();		
		Если мПодразделение.ЕстьВыделенныйСклад И Склад.КодФизическогоУзла = ОбщегоНазначения_ПИ.ЭтотУзелКод("Основной") Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Маркировка_ПИ.УзелПоКоду("SNL", "Основной"), Ссылка);
		КонецЕсли;		
	КонецЕсли;	
	//---Чирков 10.09.2029
	
	//Катаев- 03/12/14
КонецПроцедуры
